#  Задание 1
# Поработайте с переменными,создайте несколько, выведите на экран.
#  Запросите у пользователя некоторые числа и строки и сохраните в переменные
#  затем выведите на экран.

a = 10
b = 20
print(a,b)
name = input('Введите ваше имя')
age = input('Введите ваш возраст')
weight = input('Введите ваш вес')
print('Вас зовут',name,',вам',age,'лет,вы весите',weight,'кг')
